var data=[];
var dataStr='1、麦兜我和我妈妈<br>\
<br>\
导演：谢立文 / 李俊民<br>\
编剧：谢立文<br>\
主演：黄磊 / 吴君如 / 张正中 / 黄秋生 / 蔡明丽 / 更多……<br>\
类型：动作 / 奇幻 / 冒险<br>\
语言：英语<br>\
上映日期：2015-03-24(中国大陆) /2014-12-22(美国)<br>\
片长：144分钟<br>\
<br>\
<br>\
2、麦兜我和我妈妈<br>\
<br>\
导演：谢立文 / 李俊民<br>\
编剧：谢立文<br>\
主演：黄磊 / 吴君如 / 张正中 / 黄秋生 / 蔡明丽 / 更多……<br>\
类型：动作 / 奇幻 / 冒险<br>\
语言：英语<br>\
上映日期：2015-03-24(中国大陆) /2014-12-22(美国)<br>\
片长：144分钟<br>\
<br>\
<br>\
3、麦兜我和我妈妈<br>\
<br>\
导演：谢立文 / 李俊民<br>\
编剧：谢立文<br>\
主演：黄磊 / 吴君如 / 张正中 / 黄秋生 / 蔡明丽 / 更多……<br>\
类型：动作 / 奇幻 / 冒险<br>\
语言：英语<br>\
上映日期：2015-03-24(中国大陆) /2014-12-22(美国)<br>\
片长：144分钟<br>\
<br>\
<br>\
4、麦兜我和我妈妈<br>\
<br>\
导演：谢立文 / 李俊民<br>\
编剧：谢立文<br>\
主演：黄磊 / 吴君如 / 张正中 / 黄秋生 / 蔡明丽 / 更多……<br>\
类型：动作 / 奇幻 / 冒险<br>\
语言：英语<br>\
上映日期：2015-03-24(中国大陆) /2014-12-22(美国)<br>\
片长：144分钟<br>\
<br>\
<br>\
5、麦兜我和我妈妈<br>\
<br>\
导演：谢立文 / 李俊民<br>\
编剧：谢立文<br>\
主演：黄磊 / 吴君如 / 张正中 / 黄秋生 / 蔡明丽 / 更多……<br>\
类型：动作 / 奇幻 / 冒险<br>\
语言：英语<br>\
上映日期：2015-03-24(中国大陆) /2014-12-22(美国)<br>\
片长：144分钟<br>\
<br>\
<br>\
6、麦兜我和我妈妈<br>\
<br>\
导演：谢立文 / 李俊民<br>\
编剧：谢立文<br>\
主演：黄磊 / 吴君如 / 张正中 / 黄秋生 / 蔡明丽 / 更多……<br>\
类型：动作 / 奇幻 / 冒险<br>\
语言：英语<br>\
上映日期：2015-03-24(中国大陆) /2014-12-22(美国)<br>\
片长：144分钟<br>\
<br>\
<br>\
7、麦兜我和我妈妈<br>\
<br>\
导演：谢立文 / 李俊民<br>\
编剧：谢立文<br>\
主演：黄磊 / 吴君如 / 张正中 / 黄秋生 / 蔡明丽 / 更多……<br>\
类型：动作 / 奇幻 / 冒险<br>\
语言：英语<br>\
上映日期：2015-03-24(中国大陆) /2014-12-22(美国)<br>\
片长：144分钟<br>\
<br>\
<br>\
8、麦兜我和我妈妈<br>\
<br>\
导演：谢立文 / 李俊民<br>\
编剧：谢立文<br>\
主演：黄磊 / 吴君如 / 张正中 / 黄秋生 / 蔡明丽 / 更多……<br>\
类型：动作 / 奇幻 / 冒险<br>\
语言：英语<br>\
上映日期：2015-03-24(中国大陆) /2014-12-22(美国)<br>\
片长：144分钟<br>\
<br>\
<br>\
9、麦兜我和我妈妈<br>\
<br>\
导演：谢立文 / 李俊民<br>\
编剧：谢立文<br>\
主演：黄磊 / 吴君如 / 张正中 / 黄秋生 / 蔡明丽 / 更多……<br>\
类型：动作 / 奇幻 / 冒险<br>\
语言：英语<br>\
上映日期：2015-03-24(中国大陆) /2014-12-22(美国)<br>\
片长：144分钟<br>\
<br>\
<br>\
10、麦兜我和我妈妈<br>\
<br>\
导演：谢立文 / 李俊民<br>\
编剧：谢立文<br>\
主演：黄磊 / 吴君如 / 张正中 / 黄秋生 / 蔡明丽 / 更多……<br>\
类型：动作 / 奇幻 / 冒险<br>\
语言：英语<br>\
上映日期：2015-03-24(中国大陆) /2014-12-22(美国)<br>\
片长：144分钟<br>\
<br>\
<br>\
11、麦兜我和我妈妈<br>\
<br>\
导演：谢立文 / 李俊民<br>\
编剧：谢立文<br>\
主演：黄磊 / 吴君如 / 张正中 / 黄秋生 / 蔡明丽 / 更多……<br>\
类型：动作 / 奇幻 / 冒险<br>\
语言：英语<br>\
上映日期：2015-03-24(中国大陆) /2014-12-22(美国)<br>\
片长：144分钟<br>\
<br>\
<br>\
12、麦兜我和我妈妈<br>\
<br>\
导演：谢立文 / 李俊民<br>\
编剧：谢立文<br>\
主演：黄磊 / 吴君如 / 张正中 / 黄秋生 / 蔡明丽 / 更多……<br>\
类型：动作 / 奇幻 / 冒险<br>\
语言：英语<br>\
上映日期：2015-03-24(中国大陆) /2014-12-22(美国)<br>\
片长：144分钟<br>\
<br>\
<br>\
13、麦兜我和我妈妈<br>\
<br>\
导演：谢立文 / 李俊民<br>\
编剧：谢立文<br>\
主演：黄磊 / 吴君如 / 张正中 / 黄秋生 / 蔡明丽 / 更多……<br>\
类型：动作 / 奇幻 / 冒险<br>\
语言：英语<br>\
上映日期：2015-03-24(中国大陆) /2014-12-22(美国)<br>\
片长：144分钟<br>\
<br>\
<br>\
14、麦兜我和我妈妈<br>\
<br>\
导演：谢立文 / 李俊民<br>\
编剧：谢立文<br>\
主演：黄磊 / 吴君如 / 张正中 / 黄秋生 / 蔡明丽 / 更多……<br>\
类型：动作 / 奇幻 / 冒险<br>\
语言：英语<br>\
上映日期：2015-03-24(中国大陆) /2014-12-22(美国)<br>\
片长：144分钟<br>\
<br>\
<br>\
15、麦兜我和我妈妈<br>\
<br>\
导演：谢立文 / 李俊民<br>\
编剧：谢立文<br>\
主演：黄磊 / 吴君如 / 张正中 / 黄秋生 / 蔡明丽 / 更多……<br>\
类型：动作 / 奇幻 / 冒险<br>\
语言：英语<br>\
上映日期：2015-03-24(中国大陆) /2014-12-22(美国)<br>\
片长：144分钟<br>\
<br>\
<br>\
16、麦兜我和我妈妈<br>\
<br>\
导演：谢立文 / 李俊民<br>\
编剧：谢立文<br>\
主演：黄磊 / 吴君如 / 张正中 / 黄秋生 / 蔡明丽 / 更多……<br>\
类型：动作 / 奇幻 / 冒险<br>\
语言：英语<br>\
上映日期：2015-03-24(中国大陆) /2014-12-22(美国)<br>\
片长：144分钟<br>\
';
var d=dataStr.split('<br><br><br>');
console.log(d.length);
for(var i=0;i<d.length-1;i++){
	var c=d[i].split('<br><br>');
	data.push({
		img:c[0].replace('、',' ')+'.jpg',
		caption:c[0].split('、')[1],
		desc:c[1]
	});
	console.log(c[0].replace('、',' '+'.jpg'));
}

